articles/tutorials/scraping/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-04-04 Mon 04:44 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
</head>
<body>
<div id="content">
<p>
(This article is currently incomplete. I will work on it more later.)
</p>







<div id="outline-container-orgea388ac" class="outline-2">
<h2 id="orgea388ac">Using <code>sed</code> and <code>curl</code> to extract information from webpages</h2>
<div class="outline-text-2" id="text-orgea388ac">
<p>
-&#x2014;
</p>
</div>
<div id="outline-container-orge804685" class="outline-3">
<h3 id="orge804685">Introduction</h3>
<div class="outline-text-3" id="text-orge804685">
<p>
I'll go over a bit more technicalities in my article on <code>grep</code>, but I wanted to discuss a practical use of UNIX command-line tools. This is also in relation to data-hoarding, but we'll get into that.
</p>
</div>
</div>

<div id="outline-container-org77283aa" class="outline-3">
<h3 id="org77283aa">The problem</h3>
<div class="outline-text-3" id="text-org77283aa">
<p>
Detective Conan is a very long-running anime. It is basiscally season-less and has been running more-or-less continuously since 1996. As of the time of writing, there are 1036 episodes out, and every week that number ticks up by one. It's also not a masterpiece, so about 42% of that is filler.
The easy solution is to just not watch it, but I think we can do better. Here is how I found a list of canon/plot-relevant episodes, and extracted that into something to be used with various other tools at my disposal&#x2013; and how you can too!
</p>

<p>
<code>=</code>
</p>

<p>
First we google (or bing, or duck, or brave) for "detective conan list of important episodes". <a href="https://www.xerblade.com/p/detective-conan-important-episode-list.html?m=0">This</a> is the top result on Google and Brave, and is thankfully also the one I used in the past to come up with the following procedure.
</p>

<p>
In the browser, it's a pretty good page. Decorated but tasteful, modern but not bloated. Run basically by one guy, who strives to not use JavaScript as much as possible (an honorable goal).
</p>

<p>
But we're working in the command line. And on the command line, everything is reduced to plaintext. If you're lucky enough to not know what HTML looks like, here's a sample from the aformentioned page (obtained with <code>curl 'https://www.xerblade.com/p/detective-conan-important-episode-list.html?m=0'</code>):
</p>

<div class="org-src-container">
<pre class="src src-html">&lt;<span style="font-weight: bold;">span</span> <span style="font-weight: bold; font-style: italic;">class</span>=<span style="font-style: italic;">'dc-list-pos'</span>&gt;&lt;<span style="font-weight: bold;">span</span> <span style="font-weight: bold; font-style: italic;">class</span>=<span style="font-style: italic;">'dc-list-no'</span>&gt;=Main Plot=&lt;/<span style="font-weight: bold;">span</span>&gt;&lt;/<span style="font-weight: bold;">span</span>&gt;&lt;/<span style="font-weight: bold;">p</span>&gt;&lt;/<span style="font-weight: bold;">li</span>&gt;&lt;<span style="font-weight: bold;">li</span>&gt;&lt;<span style="font-weight: bold;">p</span>&gt;&lt;<span style="font-weight: bold;">span</span> <span style="font-weight: bold; font-style: italic;">class</span>=<span style="font-style: italic;">'dc-list-pos'</span>&gt;&lt;<span style="font-weight: bold;">span</span> <span style="font-weight: bold; font-style: italic;">class</span>=<span style="font-style: italic;">'dc-list-no'</span>&gt;971-974&lt;/<span style="font-weight: bold;">span</span>&gt; [INTL 1028-1031] (manga 1013-1017|V95F10-V96F3):&lt;/<span style="font-weight: bold;">span</span>&gt; &lt;<span style="font-weight: bold;">span</span> <span style="font-weight: bold; font-style: italic;">class</span>=<span style="font-style: italic;">'dc-list-char'</span>&gt;Detective &lt;<span style="font-weight: bold;">span</span> <span style="font-weight: bold; font-style: italic;">lang</span>=<span style="font-style: italic;">'ja-Latn'</span>&gt;Chiba&lt;/<span style="font-weight: bold;">span</span>&gt;&lt;/<span style="font-weight: bold;">span</span>&gt; and &lt;<span style="font-weight: bold;">span</span> <span style="font-weight: bold; font-style: italic;">class</span>=<span style="font-style: italic;">'dc-list-char'</span> <span style="font-weight: bold; font-style: italic;">lang</span>=<span style="font-style: italic;">'ja-Latn'</span>&gt;Miike&lt;/<span style="font-weight: bold;">span</span>&gt; development. &lt;<span style="font-weight: bold;">span</span> <span style="font-weight: bold; font-style: italic;">class</span>=<span style="font-style: italic;">'dc-list-char'</span> <span style="font-weight: bold; font-style: italic;">lang</span>=<span style="font-style: italic;">'ja-Latn'</span>&gt;Kuroda&lt;/<span style="font-weight: bold;">span</span>&gt; development. &lt;<span style="font-weight: bold;">span</span> <span style="font-weight: bold; font-style: italic;">class</span>=<span style="font-style: italic;">'dc-list-char'</span> <span style="font-weight: bold; font-style: italic;">lang</span>=<span style="font-style: italic;">'ja-Latn'</span>&gt;Amuro&lt;/<span style="font-weight: bold;">span</span>&gt; development. Plus a development for &lt;<span style="font-weight: bold;">span</span> <span style="font-weight: bold; font-style: italic;">class</span>=<span style="font-style: italic;">'dc-list-char'</span> <span style="font-weight: bold; font-style: italic;">lang</span>=<span style="font-style: italic;">'ja-Latn'</span>&gt;Yumi&lt;/<span style="font-weight: bold;">span</span>&gt; and &lt;<span style="font-weight: bold;">span</span> <span style="font-weight: bold; font-style: italic;">class</span>=<span style="font-style: italic;">'dc-list-char'</span> <span style="font-weight: bold; font-style: italic;">lang</span>=<span style="font-style: italic;">'ja-Latn'</span>&gt;Sh&#363;kichi&lt;/<span style="font-weight: bold;">span</span>&gt; in the background. &lt;<span style="font-weight: bold;">span</span> <span style="font-weight: bold; font-style: italic;">class</span>=<span style="font-style: italic;">'dc-list-pos'</span>&gt;&lt;<span style="font-weight: bold;">span</span> <span style="font-weight: bold; font-style: italic;">class</span>=<span style="font-style: italic;">'dc-list-no'</span>&gt;=Main Plot=&lt;/<span style="font-weight: bold;">span</span>&gt;&lt;/<span style="font-weight: bold;">span</span>&gt;&lt;/<span style="font-weight: bold;">p</span>&gt;&lt;/<span style="font-weight: bold;">li</span>&gt;&lt;<span style="font-weight: bold;">li</span>&gt;&lt;<span style="font-weight: bold;">p</span>&gt;&lt;<span style="font-weight: bold;">span</span> <span style="font-weight: bold; font-style: italic;">class</span>=<span style="font-style: italic;">'dc-list-pos'</span>&gt;&lt;<span style="font-weight: bold;">span</span> <span style="font-weight: bold; font-style: italic;">class</span>=<span style="font-style: italic;">'dc-list-no'</span>&gt;983-984&lt;/<span style="font-weight: bold;">span</span>&gt; [INTL 1040-1041] (manga 1018-1021|V96F4-7):&lt;/<span style="font-weight: bold;">span</span>&gt; &lt;<span style="font-weight: bold;">span</span> <span style="font-weight: bold; font-style: italic;">class</span>=<span style="font-style: italic;">'dc-list-char'</span> <span style="font-weight: bold; font-style: italic;">lang</span>=<span style="font-style: italic;">'ja-Latn'</span>&gt;Heiji&lt;/<span style="font-weight: bold;">span</span>&gt; case, &lt;<span style="font-weight: bold;">span</span> <span style="font-weight: bold; font-style: italic;">class</span>=<span style="font-style: italic;">'dc-list-char'</span> <span style="font-weight: bold; font-style: italic;">lang</span>=<span style="font-style: italic;">'ja-Latn'</span>&gt;Kait&#333; Kid&lt;/<span style="font-weight: bold;">span</span>&gt;, &lt;<span style="font-weight: bold;">span</span> <span style="font-weight: bold; font-style: italic;">class</span>=<span style="font-style: italic;">'dc-list-char'</span> <span style="font-weight: bold; font-style: italic;">lang</span>=<span style="font-style: italic;">'ja-Latn'</span>&gt;Morofushi&lt;/<span style="font-weight: bold;">span</span>&gt; development, &lt;<span style="font-weight: bold;">span</span> <span style="font-weight: bold; font-style: italic;">class</span>=<span style="font-style: italic;">'dc-list-char'</span> <span style="font-weight: bold; font-style: italic;">lang</span>=<span style="font-style: italic;">'ja-Latn'</span>&gt;Amuro&lt;/<span style="font-weight: bold;">span</span>&gt; development, and &lt;<span style="font-weight: bold;">span</span> <span style="font-weight: bold; font-style: italic;">class</span>=<span style="font-style: italic;">'dc-list-char'</span> <span style="font-weight: bold; font-style: italic;">lang</span>=<span style="font-style: italic;">'ja-Latn'</span>&gt;Hiromitsu&lt;/<span style="font-weight: bold;">span</span>&gt; development. &lt;<span style="font-weight: bold;">span</span> <span style="font-weight: bold; font-style: italic;">class</span>=<span style="font-style: italic;">'dc-list-pos'</span>&gt;&lt;<span style="font-weight: bold;">span</span> <span style="font-weight: bold; font-style: italic;">class</span>=<span style="font-style: italic;">'dc-list-no'</span>&gt;=Main Plot=&lt;/<span style="font-weight: bold;">span</span>&gt;&lt;/<span style="font-weight: bold;">span</span>&gt;&lt;/<span style="font-weight: bold;">p</span>&gt;&lt;/<span style="font-weight: bold;">li</span>&gt;&lt;<span style="font-weight: bold;">li</span>&gt;&lt;<span style="font-weight: bold;">p</span>&gt;&lt;<span style="font-weight: bold;">span</span> <span style="font-weight: bold; font-style: italic;">class</span>=<span style="font-style: italic;">'dc-list-pos'</span>&gt;&lt;<span style="font-weight: bold;">span</span> <span style="font-weight: bold; font-style: italic;">class</span>=<span style="font-style: italic;">'dc-list-no'</span>&gt;993-995&lt;/<span style="font-weight: bold;">span</span>&gt; [INTL 1050-1052] (manga 1022-1026|V96F8-V97F1):&lt;/<span style="font-weight: bold;">span</span>&gt; &lt;<span style="font-weight: bold;">span</span> <span style="font-weight: bold; font-style: italic;">class</span>=<span style="font-style: italic;">'dc-list-char'</span> <span style="font-weight: bold; font-style: italic;">lang</span>=<span style="font-style: italic;">'ja-Latn'</span>&gt;Sera Masumi&lt;/<span style="font-weight: bold;">span</span>&gt; development. Also, &lt;
</pre>
</div>

<p>
Sorry. You shouldn't have had to endure that. In fact, you probably didn't. I bet your eyes glazed over. In fact, this is just a segment from near the end of a <span class="underline">huge</span> pagagraph which actually contains everything we've been looking for. Obviously, just reading it like this isn't really doable. Let's chop it up into some better pieces.
</p>

<p>
<code>sed</code> is a stream editor. You give it a stream of text, and it applies a rule or conversion to the text according to the expression you put after it (the first <b>argument</b>.) It is often used for search-and-replace.
</p>

<p>
For example, we can convert every instance of <code>&gt;&lt;</code> to, say, <code>&gt; &lt;</code> or better yet to
</p>
<pre class="example">
&gt;
&lt;
</pre>
<p>
Here's the command now:
</p>

<div class="org-src-container">
<pre class="src src-shell">curl <span style="font-style: italic;">'https://www.xerblade.com/p/detective-conan-important-episode-list.html?m=0'</span> | sed <span style="font-style: italic;">'s/&gt;&lt;/&gt;\n&lt;/g'</span>
</pre>
</div>

<p>
The <code>s/thing1/thing2/g</code> tells <code>sed</code> to _S<sub>ubstitute</sub> thing1 with thing2 _G<sub>lobally</sub>, every time in the line. Without the <code>g</code> it would only do the first one (which is useful but not here). That <code>\n</code> is what's called a <b>regular expression</b>&#x2013; this one specifically means "newline". You often can't type an actual Enter character on the command line because it'll try to execute, so using <code>\n</code> works better.
</p>

<p>
Anyway.
</p>

<p>
Now the bits of that paragraph each look something like this:
</p>
<div class="org-src-container">
<pre class="src src-html">&lt;<span style="font-weight: bold;">span</span> <span style="font-weight: bold; font-style: italic;">class</span>=<span style="font-style: italic;">'dc-list-pos'</span>&gt;
  &lt;<span style="font-weight: bold;">span</span> <span style="font-weight: bold; font-style: italic;">class</span>=<span style="font-style: italic;">'dc-list-no'</span>&gt;971-974&lt;/<span style="font-weight: bold;">span</span>&gt; [INTL 1028-1031] (manga 1013-1017|V95F10-V96F3):&lt;/<span style="font-weight: bold;">span</span>&gt; &lt;<span style="font-weight: bold;">span</span> <span style="font-weight: bold; font-style: italic;">class</span>=<span style="font-style: italic;">'dc-list-char'</span>&gt;Detective &lt;<span style="font-weight: bold;">span</span> <span style="font-weight: bold; font-style: italic;">lang</span>=<span style="font-style: italic;">'ja-Latn'</span>&gt;Chiba&lt;/<span style="font-weight: bold;">span</span>&gt;
&lt;/<span style="font-weight: bold;">span</span>&gt; and &lt;<span style="font-weight: bold;">span</span> <span style="font-weight: bold; font-style: italic;">class</span>=<span style="font-style: italic;">'dc-list-char'</span> <span style="font-weight: bold; font-style: italic;">lang</span>=<span style="font-style: italic;">'ja-Latn'</span>&gt;Miike&lt;/<span style="font-weight: bold;">span</span>&gt; development. &lt;<span style="font-weight: bold;">span</span> <span style="font-weight: bold; font-style: italic;">class</span>=<span style="font-style: italic;">'dc-list-char'</span> <span style="font-weight: bold; font-style: italic;">lang</span>=<span style="font-style: italic;">'ja-Latn'</span>&gt;Kuroda&lt;/<span style="font-weight: bold;">span</span>&gt; development. &lt;<span style="font-weight: bold;">span</span> <span style="font-weight: bold; font-style: italic;">class</span>=<span style="font-style: italic;">'dc-list-char'</span> <span style="font-weight: bold; font-style: italic;">lang</span>=<span style="font-style: italic;">'ja-Latn'</span>&gt;Amuro&lt;/<span style="font-weight: bold;">span</span>&gt; development. Plus a development for &lt;<span style="font-weight: bold;">span</span> <span style="font-weight: bold; font-style: italic;">class</span>=<span style="font-style: italic;">'dc-list-char'</span> <span style="font-weight: bold; font-style: italic;">lang</span>=<span style="font-style: italic;">'ja-Latn'</span>&gt;Yumi&lt;/<span style="font-weight: bold;">span</span>&gt; and &lt;<span style="font-weight: bold;">span</span> <span style="font-weight: bold; font-style: italic;">class</span>=<span style="font-style: italic;">'dc-list-char'</span> <span style="font-weight: bold; font-style: italic;">lang</span>=<span style="font-style: italic;">'ja-Latn'</span>&gt;Sh&#363;kichi&lt;/<span style="font-weight: bold;">span</span>&gt; in the background. &lt;<span style="font-weight: bold;">span</span> <span style="font-weight: bold; font-style: italic;">class</span>=<span style="font-style: italic;">'dc-list-pos'</span>&gt;
  &lt;<span style="font-weight: bold;">span</span> <span style="font-weight: bold; font-style: italic;">class</span>=<span style="font-style: italic;">'dc-list-no'</span>&gt;=Main Plot=&lt;/<span style="font-weight: bold;">span</span>&gt;
&lt;/<span style="font-weight: bold;">span</span>&gt;
&lt;/<span style="font-weight: bold;">p</span>&gt;
&lt;/<span style="font-weight: bold;">li</span>&gt;
&lt;<span style="font-weight: bold;">li</span>&gt;
  &lt;<span style="font-weight: bold;">p</span>&gt;
</pre>
</div>
<p>
Not completely immune to overlong lines, but it's something.
Now pay attention to that line that says <code>class ='dc-list-no'&gt;971-974&lt;/span&gt;</code>. If we go back to the browser and control-F '971-974' we find&#x2026; that there are no results because the page is portioned out per hundred episodes. Let's click on the 900s tab and try again.
</p>

<p>
Aaand it looks like this:
</p>

<p>
<b>971-974</b> [INTL 1028-1031] (manga 1013-1017|V95F10-V96F3): Detective Chiba and Miike development. Kuroda development. Amuro development. Plus a development for Yumi and Shūkichi in the background. \**Main Plot*\*
</p>

<p>
As you can see, the author has very kindly left a keyword next to every episode number or range that does not appear in the page itself: <code>dc-list-no</code>. Let's try <code>grep</code> ing the whole mess for that string.
</p>

<div class="org-src-container">
<pre class="src src-shell">curl <span style="font-style: italic;">'https://www.xerblade.com/p/detective-conan-important-episode-list.html?m=0'</span> | sed <span style="font-style: italic;">'s/&gt;&lt;/&gt;\n&lt;/g'</span> | grep <span style="font-style: italic;">'dc-list-no'</span>
</pre>
</div>

<p>
Now we end up with blocks that look like
</p>
<div class="org-src-container">
<pre class="src src-html">&lt;<span style="font-weight: bold;">span</span> <span style="font-weight: bold; font-style: italic;">class</span>=<span style="font-style: italic;">'dc-list-no'</span>&gt;971-974&lt;/<span style="font-weight: bold;">span</span>&gt; [INTL 1028-1031] (manga 1013-1017|V95F10-V96F3):&lt;/<span style="font-weight: bold;">span</span>&gt; &lt;<span style="font-weight: bold;">span</span> <span style="font-weight: bold; font-style: italic;">class</span>=<span style="font-style: italic;">'dc-list-char'</span>&gt;Detective &lt;<span style="font-weight: bold;">span</span> <span style="font-weight: bold; font-style: italic;">lang</span>=<span style="font-style: italic;">'ja-Latn'</span>&gt;Chiba&lt;/<span style="font-weight: bold;">span</span>&gt;
  &lt;<span style="font-weight: bold;">span</span> <span style="font-weight: bold; font-style: italic;">class</span>=<span style="font-style: italic;">'dc-list-no'</span>&gt;*Main Plot*&lt;/<span style="font-weight: bold;">span</span>&gt;
</pre>
</div>

<p>
Hmmm. Not perfect. But we're getting there. Most lines now either contain the episode numbers like we want, or not much numbers at all. There are some like
</p>
<div class="org-src-container">
<pre class="src src-html">&lt;<span style="font-weight: bold;">span</span> <span style="font-weight: bold; font-style: italic;">class</span>=<span style="font-style: italic;">'dc-list-no'</span>&gt;(Both 1 Hour Specials)&lt;/<span style="font-weight: bold;">span</span>&gt;
</pre>
</div>
<p>
but that's probably alright as you'll see.
</p>

<p>
-&#x2014;
</p>

<p>
What we can do now is filter for the numbers themselves. We know that there are <code>&gt;&lt;</code> around the numbers, and they can be in either <code>XYY-XYZ</code> format, or just a single number.
</p>

<p>
In extended regex, a sequence in <code>[square brackets]</code> denotes a set of possible matches of each character. So, for example, <code>[ckq]</code> will match a lowercase c, or a lowercase k, or a lowercase q. The spec also allows for comon ranges, like <code>[A-Z]</code> (any uppercase letter), <code>[a-z]</code> (any lowercase letter), or for our use case, <code>[0-9]</code>, any single number digit.
</p>

<p>
So we can 
</p>

<div class="org-src-container">
<pre class="src src-shell">curl <span style="font-style: italic;">'https://www.xerblade.com/p/detective-conan-important-episode-list.html?m=0'</span> | sed <span style="font-style: italic;">'s/&gt;&lt;/&gt;\n&lt;/g'</span> | grep <span style="font-style: italic;">'dc-list-no'</span> | sed <span style="font-style: italic;">'s/</span>
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2022-04-04 Mon 04:44</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 26.3 (<a href="https://orgmode.org">Org</a> mode 9.1.9)</p>
<p class="validation"></p>
</div>
</body>
</html>
